## __(30-B) Pandas__
- PANel Data AnalysiS
- Series(1차원), DataFrame(2차원)
- Panel(3차원 이상)을 통해서 data들을 다루기 쉽다.(Panel은 거의 안쓴다/없어질 가능성도 있음)
- missing data를 다루기 쉽다,
- columns의 Add & drop이 쉽다.
- Groupby & Aggregation이 강력한 도구임.
- label base로 slicing할 수 있고 label부르기가 쉽다.

### <Font color = white>Limitation of Numpy Object
- Numpy의 한계는 Grouping, 시간 data, data join등 data 추출하기에 한계가 있다.
***

In [2]:
import numpy as np
import pandas as pd

a = np.array([[1,2,3],[4,5,6]], float)
print(a[1,:])
print(a[:,2])
print(a[-1:,-2:])

[ 4.  5.  6.]
[ 3.  6.]
[[ 5.  6.]]

### <Font color = white>Series Creation
- Numpy의 Array를 Pandas의 Series로 만들 수 있다.
***

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

s = pd.Series([1,3,5,np.nan,6,8]) # NAN이 있으면 float타입으로 data들이 나타난다.
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
# Numpy의 array를 Series로 만들 수 있다.
np_s = np.array([1,3,4,np.nan,6,8])
pd_s = pd.Series(np_s)
print(np_s)
print(pd_s)

[  1.   3.   4.  nan   6.   8.]
0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
from pandas import Series, DataFrame
import pandas as pd
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000} # Key값들은 사전순으로 나열된다.
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [4]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj4 = Series(sdata, index =states) # 여기서는 index를 중심으로 Series가 생성되고 / index에 없는건 생성 안됨(Utah)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

d = {'a' : 0., 'b' : 1., 'c' : 2.}
print(type(d))

<class 'dict'>

※value값이 특이하게 나오니깐 알아두자

In [13]:
d = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(d) # key값이 index가 되고 value값은 0.이 아니라 0.0까지 나온다.

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### <Font color = white>Null Check in Series : isnull()과 notnull()
[ 2가지 표기 방식이 있음] <br>
1) pd.isnull(오브젝트) <br>
2) 오브젝트.isnull()
***

In [19]:
print(pd.isnull(obj4))
print()
print(obj4.isnull())

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
print(pd.notnull(obj4))
print()
print(obj4.notnull())

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

### <Font color = white>DataFrame Creation
***

In [60]:
sales_stats = {'Day' : [1,2,3,4,5,6],
               'Visitors': [43, 45, 33, 43, 78, 44],
               'Revenue' : [64,73,62,64,53,66]}
df = pd.DataFrame(sales_stats)
df

   Day  Revenue  Visitors
0    1       64        43
1    2       73        45
2    3       62        33
3    4       64        43
4    5       53        78
5    6       66        44

### <Font color = white>DataFrame indexing 
- df[] / df.loc[] / df.iloc[] 모두 대괄호 쓴다
- DataFrame indexing헷갈리는 부분 <br>
1) df[col이름] 과 df[row시작:row끝] 헷갈리지 말자 <br>
2) df.loc[row시작:row끝]을 쓸 때 rowname(idx)가 uniq하지 않으면, ERROR가 발생한다.<br>
3) df.iloc[row시작:row끝] / df[row시작 : row끝] 은 두개다 row끝이 포함되지 않는다.<br>
<font color = red>4) 3)번과 달리 df.loc[row시작:row끝]은 양쪽다 포함된다
***

In [64]:
sales_stats = {'Day' : [1,2,3,4,5,6],
               'Visitors': [43, 45, 33, 43, 78, 44],
               'Revenue' : [64,73,62,64,53,66]}
df = pd.DataFrame(sales_stats)
df

print(df.loc[:3]) #range랑 다르다. :3이라고하면 3까지 포함한다.
print()
print(df.iloc[:3])

   Day  Revenue  Visitors
0    1       64        43
1    2       73        45
2    3       62        33
3    4       64        43

   Day  Revenue  Visitors
0    1       64        43
1    2       73        45
2    3       62        33

In [65]:
# Day를 rowname으로 써보자
sales_stats = {'Day' : [1,2,3,4,5,6],
               'Visitors': [43, 45, 33, 43, 78, 44],
               'Revenue' : [64,73,62,64,53,66]}
df = pd.DataFrame(sales_stats)
df

df = df.set_index('Visitors')
print(df.iloc[0:5])
print(df[0:5])
print(df.loc[45:44]) # 여기서 43:44라고하면 43이 2개 있어서 에러남!

# df.iloc[:] 이나 df[:]은 range 처럼 시작점은 포함하지만 끝점은 포함하지 않는다. but df.loc[:]시작점 끝점 다 포함한다.

          Day  Revenue
Visitors
43          1       64
45          2       73
33          3       62
43          4       64
78          5       53
          Day  Revenue
Visitors
43          1       64
45          2       73
33          3       62
43          4       64
78          5       53
          Day  Revenue
Visitors
45          2       73
33          3       62
43          4       64
78          5       53
44          6       66

In [68]:
#이렇게 한개의 row를 선택하면 Series로 보이는데 column명은 행idx처럼 들어온다
df.loc[33]

Day         3
Revenue    62
Name: 33, dtype: int64

In [70]:
df.loc[33:44]

          Day  Revenue
Visitors
33          3       62
43          4       64
78          5       53
44          6       66

### <Font color = white>Accessing Rows/Columns
***

In [78]:
print(df.iloc[1])
print()
print(df.loc[45])

Day         2
Revenue    73
Name: 45, dtype: int64

Day         2
Revenue    73
Name: 45, dtype: int64

In [79]:
sales_stats = {'Visitors': [43, 45, 33, 43, 78, 44],
               'Revenue' : [64,73,62,64,53,66]}
# 이렇게 DataFrame만들때 data(딕셔너리형태가 많음), index를 지정해서 주는 경우 많다.
df2 = pd.DataFrame(sales_stats, index = ['a', 'b','c','d','e','f'])
print(df2)

print(df2.loc['f'])
print()
print(df2.loc['c':'e'])
print()
print(df2.iloc[3:5])

   Revenue  Visitors
a       64        43
b       73        45
c       62        33
d       64        43
e       53        78
f       66        44
Revenue     66
Visitors    44
Name: f, dtype: int64

   Revenue  Visitors
c       62        33
d       64        43
e       53        78

   Revenue  Visitors
d       64        43
e       53        78

In [80]:
# & : or 기호이고 /  |: and기호임을 알아두자
print(df2[df2['Revenue']>65])
print(df2[(df2['Revenue']>65) | (df2['Visitors']>70)])

   Revenue  Visitors
b       73        45
f       66        44
   Revenue  Visitors
b       73        45
e       53        78
f       66        44

In [81]:
print(df2['Visitors'])
print()
print(df2[['Visitors', 'Revenue']])

a    43
b    45
c    33
d    43
e    78
f    44
Name: Visitors, dtype: int64

   Visitors  Revenue
a        43       64
b        45       73
c        33       62
d        43       64
e        78       53
f        44       66

### <Font color = white>Columns Manipulation
- ※ axis = 0 -> col 선택 / axis = 1 -> row 선택
***

In [83]:
# col 순서를 바꿀 수 있다.
print(df2)
print()
DataFrame(df2, columns = ['Visitors', 'Revenue'])

   Revenue  Visitors
a       64        43
b       73        45
c       62        33
d       64        43
e       53        78
f       66        44

   Visitors  Revenue
a        43       64
b        45       73
c        33       62
d        43       64
e        78       53
f        44       66

In [51]:
# Debt이라는 Column은 없었는데 이렇게 써줌으로서 생성할 수 있다.
# BUT!!! Nan이 행갯수만큼 생기니 추천하는 방식은 아니다..
DataFrame(df2, columns = ['Visitors', 'Revenue','Debt'])

   Visitors  Revenue  Debt
a        43       64   NaN
b        45       73   NaN
c        33       62   NaN
d        43       64   NaN
e        78       53   NaN
f        44       66   NaN

In [85]:
df3 = DataFrame(df2, columns = ['Visitors', 'Revenue', 'Debt'])
del df3['Debt']
# del말고 drop함수로도 삭제가능 : 아래 셀 참조할 것.
df3

   Visitors  Revenue
a        43       64
b        45       73
c        33       62
d        43       64
e        78       53
f        44       66

In [56]:
df3 = DataFrame(df2, columns = ['Visitors', 'Revenue', 'Debt'])
print(df3)
df3.drop('Debt', axis=1)

   Visitors  Revenue  Debt
a        43       64   NaN
b        45       73   NaN
c        33       62   NaN
d        43       64   NaN
e        78       53   NaN
f        44       66   NaN

   Visitors  Revenue
a        43       64
b        45       73
c        33       62
d        43       64
e        78       53
f        44       66

### <Font color = white>Row Manipulation
***

In [63]:
df3 = DataFrame(df2, columns = ['Visitors', 'Revenue'])
df3
df3.loc['h'] = [200, 77]
df3

   Visitors  Revenue
a        43       64
b        45       73
c        33       62
d        43       64
e        78       53
f        44       66
h       200       77

### <Font color = white>Rename Row/Column
- 기본 코드 형식 : Change_dict = {'old_name1' : 'new_name1', 'old_name2' : 'new_name2'}
- column 명 rename : df.rename(columns = Change_dict) <br>※Change_dict라고 선언한 형식한 걸로 바꿔준다는 뜻
- row 명 rename : df.rename(index = Change_dict)
***

In [70]:
# colname 바꾸기
df = pd.DataFrame({'A' : [1,4,7], 'B' : [2,5,8], 'C' : [3,6,9]})
df
newcols = {'A':'new_col_1', 'B' : 'new_col_2', 'C' : 'new_col_3'}
df.rename(columns = newcols)

   new_col_1  new_col_2  new_col_3
0          1          2          3
1          4          5          6
2          7          8          9

In [69]:
# rowname 바꾸기
df = pd.DataFrame({'A' : [1,4,7], 'B' : [2,5,8], 'C' : [3,6,9]})
df
df.rename(index = {1:'a'})

   A  B  C
0  1  2  3
a  4  5  6
2  7  8  9

In [87]:
df = pd.DataFrame({'A' : [1,4,7], 'B' : [2,5,8], 'C' : [3,6,9]})
newrows = { 0 :'new_row_1', 1 : 'new_row_2', 2 : 'new_row_3'}
df.rename(index = newrows)

           A  B  C
new_row_1  1  2  3
new_row_2  4  5  6
new_row_3  7  8  9

#### <Font color = white>※Common Statistical Functions
***

In [71]:
df2

   Revenue  Visitors
a       64        43
b       73        45
c       62        33
d       64        43
e       53        78
f       66        44

In [72]:
# count할 때는 Mask를 씌워줘야함.
df2[df2['Revenue']>65].count()

Revenue     2
Visitors    2
dtype: int64

In [73]:
df2['Revenue'].mean()

63.666666666666664

In [88]:
df2.cov()
# 여기서 1행1열 및 2행2열 자기자신의 분산을 뜻한다.

            Revenue    Visitors
Revenue   41.866667  -67.133333
Visitors -67.133333  239.866667

In [7]:
import pandas as pd
import numpy as np
df = pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9]]), columns = ['A','B','C'])
for index, row in df.iterrows():
                  print(index, row)

0 A    1
B    2
C    3
Name: 0, dtype: int32
1 A    4
B    5
C    6
Name: 1, dtype: int32
2 A    7
B    8
C    9
Name: 2, dtype: int32

### <Font color = red>__Groupby and Aggregation__ : Pandas의 강점 중 하나
- 지정할변수 = df.groupby(col명1, col명2) : input으로 column명이 들어와야한다
- 지정한변수.mean() , 지정한변수.sum() 가능 : 이때 수치형자료들만 가지고 계산해준다
- 지정한변수.get_group('그룹내의 컨텐츠') : 그룹내의 컨텐츠에 해당하는 값들만 따로 볼 수 있다.
***

In [9]:
df = pd.DataFrame({'A' : ['foo','bar','foo','bar','foo','bar','foo','foo'],
                  'B' : ['one', 'one','two','three','two','two','one','three'],
                  'C' : np.random.randn(8),
                  'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.327308 -0.123099
1  bar    one -1.571095  1.384021
2  foo    two -0.438812 -0.366677
3  bar  three  2.027967  0.446959
4  foo    two -1.663129  0.317726
5  bar    two -1.834201  1.176692
6  foo    one -0.604886  0.817233
7  foo  three  1.533295  0.764672

In [10]:
grouped = df.groupby('A')
print(grouped) #이렇게해선 어떻게 groupby됐는지 보기힘들다.
print(df[df['A'] == 'foo'])
print()
print(df[df['A'] == 'bar'])
print()
print(grouped.mean())

<pandas.core.groupby.DataFrameGroupBy object at 0x0000020D8323F4A8>
     A      B         C         D
0  foo    one  0.327308 -0.123099
2  foo    two -0.438812 -0.366677
4  foo    two -1.663129  0.317726
6  foo    one -0.604886  0.817233
7  foo  three  1.533295  0.764672

     A      B         C         D
1  bar    one -1.571095  1.384021
3  bar  three  2.027967  0.446959
5  bar    two -1.834201  1.176692

            C         D
A
bar -0.459110  1.002557
foo -0.169245  0.281971

In [11]:
# 이렇게 groupby할 것을 2개 써줄 수 있다.
grouped2 = df.groupby(['A','B'])
grouped2.mean()

                  C         D
A   B
bar one   -1.571095  1.384021
    three  2.027967  0.446959
    two   -1.834201  1.176692
foo one   -0.138789  0.347067
    three  1.533295  0.764672
    two   -1.050971 -0.024475

In [12]:
grouped.get_group('bar')
# groupby한 A의 컨텐츠인 bar에 해당하는 값들을 볼 수 있음(get_group())

     A      B         C         D
1  bar    one -1.571095  1.384021
3  bar  three  2.027967  0.446959
5  bar    two -1.834201  1.176692

### <Font color = white>Mergin(joining) DataFrames
- 형식 : pd.merge(left, right, how = , left/right_index = True, left/right_on = col명, on ='key')
- 예 : df5 = pd.merge(df3, df4, how ='inner' or 'left', left_index = True, right_index=True, right_on = 'col명', left_on='col'명
- df3.head() : df3의 앞부분을 볼 수 있다.
***

#### <Font color = white>Time Series Data
***

In [103]:
import pandas as pd
pd.Series(['Jul 31, 2009', '2010-01-10',None])

0    Jul 31, 2009
1      2010-01-10
2            None
dtype: object

In [105]:
pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10',None]))

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

In [106]:
#list를 입력할경우 DatetimeIndex가 생성된다
pd.to_datetime(['2005/11/23','2010.12.31'])

DatetimeIndex(['2005-11-23', '2010-12-31'], dtype='datetime64[ns]', freq=None)

In [108]:
import pandas as pd

rng = pd.date_range('1/1/2011', periods = 72, freq = 'H')
print(rng)
print()
rng[:5]

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00',
               '2011-01-01 06:00:00', '2011-01-01 07:00:00',
               '2011-01-01 08:00:00', '2011-01-01 09:00:00',
               '2011-01-01 10:00:00', '2011-01-01 11:00:00',
               '2011-01-01 12:00:00', '2011-01-01 13:00:00',
               '2011-01-01 14:00:00', '2011-01-01 15:00:00',
               '2011-01-01 16:00:00', '2011-01-01 17:00:00',
               '2011-01-01 18:00:00', '2011-01-01 19:00:00',
               '2011-01-01 20:00:00', '2011-01-01 21:00:00',
               '2011-01-01 22:00:00', '2011-01-01 23:00:00',
               '2011-01-02 00:00:00', '2011-01-02 01:00:00',
               '2011-01-02 02:00:00', '2011-01-02 03:00:00',
               '2011-01-02 04:00:00', '2011-01-02 05:00:00',
               '2011-01-02 06:00:00', '2011-01-02 07:00:00',
               '2011-01-02 08:00:00', '2011-01-02 09:00:00',
               '2011-01-02 10:00:00', '2011-01-02 11:00:00',
               '2011-01-02 12:00:00', '2011-01-02 13:00:00',
               '2011-01-02 14:00:00', '2011-01-02 15:00:00',
               '2011-01-02 16:00:00', '2011-01-02 17:00:00',
               '2011-01-02 18:00:00', '2011-01-02 19:00:00',
               '2011-01-02 20:00:00', '2011-01-02 21:00:00',
               '2011-01-02 22:00:00', '2011-01-02 23:00:00',
               '2011-01-03 00:00:00', '2011-01-03 01:00:00',
               '2011-01-03 02:00:00', '2011-01-03 03:00:00',
               '2011-01-03 04:00:00', '2011-01-03 05:00:00',
               '2011-01-03 06:00:00', '2011-01-03 07:00:00',
               '2011-01-03 08:00:00', '2011-01-03 09:00:00',
               '2011-01-03 10:00:00', '2011-01-03 11:00:00',
               '2011-01-03 12:00:00', '2011-01-03 13:00:00',
               '2011-01-03 14:00:00', '2011-01-03 15:00:00',
               '2011-01-03 16:00:00', '2011-01-03 17:00:00',
               '2011-01-03 18:00:00', '2011-01-03 19:00:00',
               '2011-01-03 20:00:00', '2011-01-03 21:00:00',
               '2011-01-03 22:00:00', '2011-01-03 23:00:00'],
              dtype='datetime64[ns]', freq='H')

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [110]:
import pandas as pd
ts = pd.Series(np.random.randn(len(rng)),index=rng)
ts.head()

2011-01-01 00:00:00    0.746033
2011-01-01 01:00:00   -0.348095
2011-01-01 02:00:00   -0.897945
2011-01-01 03:00:00   -0.521610
2011-01-01 04:00:00   -0.156220
Freq: H, dtype: float64

In [112]:
#truncate : 아래나 위를 잘라서 길이를 줄이다.
ts.truncate(before = '01/02/2011', after ='01/03/2011')
# ts에서 before부터 after까지 있는 시간들을 지우는것

2011-01-02 00:00:00    0.918271
2011-01-02 01:00:00   -2.136851
2011-01-02 02:00:00    1.249372
2011-01-02 03:00:00    0.163342
2011-01-02 04:00:00    0.544781
2011-01-02 05:00:00    0.003264
2011-01-02 06:00:00   -2.273816
2011-01-02 07:00:00   -0.550806
2011-01-02 08:00:00    1.215268
2011-01-02 09:00:00    0.314831
2011-01-02 10:00:00   -0.714579
2011-01-02 11:00:00   -0.860815
2011-01-02 12:00:00   -0.252944
2011-01-02 13:00:00   -1.686924
2011-01-02 14:00:00    0.372907
2011-01-02 15:00:00   -0.698992
2011-01-02 16:00:00   -0.712861
2011-01-02 17:00:00    0.678361
2011-01-02 18:00:00    0.134395
2011-01-02 19:00:00   -0.428092
2011-01-02 20:00:00   -0.602283
2011-01-02 21:00:00   -0.935038
2011-01-02 22:00:00    0.814636
2011-01-02 23:00:00    1.334731
2011-01-03 00:00:00    0.464847
Freq: H, dtype: float64